Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: Leading whitespace characters (blanks and TABs) are always ignored.
es_es: Los espacios en blanco al principio de cada línea (espacios y tabulados) siempre se ignoran.

source: The whitespaces between parameters (e.g. between the 'set' and the 'cpoptions' in the example below) are reduced to one blank character and plays the role of a separator, the whitespaces after the last (visible) character may or may not be ignored depending on the situation, see below.
es_es: Los espacios en blanco entre parámetros (por ejemplo, entre 'set' y 'cpoptions' en el ejemplo a continuación) se reducen a un solo espacio blanco que actúa como separador, los espacios en blanco después del último carácter (visible) se pueden o no ignorar dependiendo del caso, véase a continuación.

source: the whitespace immediately before the "=" sign is ignored.
es_es: se ignora el espacio en blanco inmediatamente antes del símbolo «=».

source: But there can be no whitespace after the "=" sign!
es_es: ¡Pero no puede haber espacios a continuación del símbolo «=»!

source: The character " (the double quote mark) starts a comment.
es_es: El carácter " (comilla doble) marca el inicio de un comentario.

source: Everything after and including this character until the end-of-line is considered a comment and is ignored, except for commands that don't consider comments, as shown in examples below.
es_es: Todo lo que aparece a continuación de éste carácter hasta el fin de línea, e incluyéndola, se considera un comentario y es ignorado, a excepción de las órdenes que no tienen en cuenta los comentarios, como se puede ver en ejemplos de esta sección.

source: A comment can start on any character position on the line.
es_es: Un comentario puede empezar en cualquier punto de una línea de texto.

source: There is a little "catch" with comments for some commands.
es_es: Hay un pequeño «pero» con los comentarios y ciertas órdenes.

source: The abbreviation 'dev' will be expanded to 'development " shorthand'.
es_es: La abreviación 'dev' se expandirá a 'desarrollo " abreviación'.

source: The mapping of <F3> will actually be the whole line after the 'o# ....' including the '" insert include'.
es_es: La macro <F3> constará en realidad de toda la línea desde 'o# ....' incluyendo '" insertar directiva include'.

source: The "execute" command will give an error.
es_es: La orden «execute» provocará un error.

source: The "!" command will send everything after it to the shell, causing an error for an unmatched '"' character.
es_es: La orden «!» enviará todos los caracteres a continuación al intérprete de órdenes, provocando un error debido al carácter '"' sin la comilla de cierre correspondiente.

source: There can be no comment after ":map", ":abbreviate", ":execute" and "!" commands (there are a few more commands with this restriction).
es_es: No pueden existir comentarios a continuación de las órdenes «:map», «:abbreviate», «:execute», ni «!» (hay algunas órdenes más con esta restricción).

source: For the ":map", ":abbreviate" and ":execute" commands there is a trick: >
es_es: Para el caso de las órdenes «:map», «:abbreviate», y «:execute» hay un truco disponible: >

source: With the '|' character the command is separated from the next one.
es_es: El carácter «|» permite separar órdenes.

source: And that next command is only a comment.
es_es: En este caso, la siguiente orden es simplemente un comentario.

source: For the last command you need to do two things: |:execute| and use '|': > :exe '!ls *.c' |" list C files
es_es: Para la última orden hay que hacer dos cosas: |:execute| y usar «|»: > :exe '!ls *.c' |" listar archivos C

source: Notice that there is no white space before the '|' in the abbreviation and mapping.
es_es: Observe que no hay espacios en blanco antes de «|» en la abreviación ni en la macro.

source: For these commands, any character until the end-of-line or '|' is included.
es_es: En estas órdenes, se incluye cualquier carácter hasta el fin de línea o hasta «|».

source: As a consequence of this behavior, you don't always see that trailing whitespace is included: >
es_es: Como consecuencia de este comportamiento, no siempre es visible cuándo se incluyen espacios en blanco al final del a línea: >

source: The "#" command by itself lists a line with the line number.
es_es: Por sí misma, la orden «#» muestra una línea junto con su número de línea.

source: Adding an exclamation mark changes it into doing nothing, so that you can add the shell command to execute the rest of the file.
es_es: Al añadirle un símbolo de exclamación su comportamiento cambia y no tiene efecto, así que puede añadir la orden de intérprete de órdenes para ejecutar el resto del archivo.

source: Here the unmap command will not work, because it tries to unmap ",ab ".
es_es: Aquí la orden unmap no funcionará, porque trata de eliminar la macro «,ab ».

source: This does not exist as a mapped sequence.
es_es: Ésta no existe como secuencia de ninguna macro.

source: An error will be issued, which is very hard to identify, because the ending whitespace character in ":unmap ,ab " is not visible.
es_es: Se mostrará un error, que es muy difícil de identificar, porque el carácter de espacio final en «:unmap ,ab» no es visible.

source: Here the comment part will be ignored.
es_es: La parte correspondiente al comentario será ignorada.

source: However, Vim will try to unmap ',ab ', which does not exist.
es_es: Sin embargo, Vim tratará de eliminar la macro ',ab ', que no existe.

source: Rewrite it as: >
es_es: Debe reescribir la orden como: >

source: Sometimes you want to make a change and go back to where cursor was.
es_es: En ocasiones es deseable hacer un cambio y volver al sitio en que el cursor se encontraba inicialmente.

source: Restoring the relative position would also be nice, so that the same line appears at the top of the window.
es_es: Recuperar la posición relativa también sería agradable, de tal forma que la misma línea inicial aparezca al inicio de la ventana.

source: This example yanks the current line, puts it above the first line in the file and then restores the view: >
es_es: Este ejemplo copia la línea actual, la inserta antes de la primera línea en el archivo y después restaura la vista original: >

source: To avoid your function names to interfere with functions that you get from others, use this scheme: - Prepend a unique string before each function name.
es_es: Para evitar que los nombres de funciones que defina interfieran con otras funciones, use el siguiente esquema: - Anteponga una cadena única a cada nombre de función.

source: I often use an abbreviation.
es_es: A menudo uso una abreviatura.

source: For example, "OW_" is used for the option window functions.
es_es: Por ejemplo, uso «OV» para las funciones relacionadas con opciones de ventana.

source: - Put the definition of your functions together in a file.
es_es: - Ponga todas las definiciones de sus funciones en un mismo archivo.

source: Set a global variable to indicate that the functions have been loaded.
es_es: Cree una variable global para indicar que las funciones ya fueron cargadas.

source: When sourcing the file again, first unload the functions.
es_es: Cuando cargue el archivo de nuevo, elimine antes las definiciones de las funciones.

source: function XXX_one(a) ... body of function ...
es_es: function XXX_uno(a) ... cuerpo de la función ...

source: function XXX_two(b) ... body of function ...
es_es: function XXX_dos(b) ... cuerpo de la función ...

source: You can write a Vim script in such a way that many people can use it.
es_es: Puede crear un script de Vim de tal forma que lo puedan usar varias personas.

source: This is called a plugin.
es_es: Esto se llama una extensión.

source: Vim users can drop your script in their plugin directory and use its features right away |add-plugin|.
es_es: Los usuarios de Vim pueden copiar el script en su directorio «plugin/», y utilizarlo en el momento con |add-plugin|.

source: In this section the first type is explained.
es_es: En esta sección se describirán las extensiones globales («global plugins»).

source: Most items are also relevant for writing filetype plugins.
es_es: La mayoría de elementos también son necesarios para escribir extensiones de tipo de archivo («filetype plugins»).

source: The specifics for filetype plugins are in the next section |write-filetype-plugin|.
es_es: La sección a continuación, |write-filetype-plugin|, detalla las extensiones de tipo de archivo.

source: First of all you must choose a name for your plugin.
es_es: Primero, debe elegir un nombre para su extensión.

source: The features provided by the plugin should be clear from its name.
es_es: El nombre debería mostrar las funcionalidades ofrecidas por la extensión.

source: And it should be unlikely that someone else writes a plugin with the same name but which does something different.
es_es: Así mismo, debería ser poco probable que alguien escriba una extensión con el mismo nombre pero otras funcionalidades.

source: And please limit the name to 8 characters, to avoid problems on old Windows systems.
es_es: Por último, limite el nombre a ocho caracteres para evitar problemas en antiguos sistemas de Windows.

source: A script that corrects typing mistakes could be called "typecorr.vim".
es_es: Un script que corrige errores tipográficos se podría llamar «correccort.vim».

source: We will use it here as an example.
es_es: Lo usaremos como ejemplo.

source: You will probably add new corrections to the plugin and soon have several versions laying around.
es_es: Lo más probable es que añada nuevas correcciones a la extensión, y tenga en poco tiempo varias versiones de ésta.

source: And when distributing this file, people will want to know who wrote this wonderful plugin and where they can send remarks.
es_es: Cuando distribuya el archivo, la gente querrá saber quién escribió esta maravillosa extensión, y dónde pueden enviar comentarios.

source: Therefore, put a header at the top of your plugin: >
es_es: Por ello, incluya un encabezado al principio de su extensión: >

source: About copyright and licensing: Since plugins are very useful and it's hardly worth restricting their distribution, please consider making your plugin either public domain or use the Vim |license|.
es_es: Derechos de autor y licencias: Debido a que las extensiones son útiles, y que no merece la pena restringir su distribución, considere que su extensión sea de dominio público, o use la licencia de Vim (|license|).

source: A short note about this near the top of the plugin should be sufficient.
es_es: Una breve nota cerca del inicio de la extensión debería servir.

source: In line 18 above, the line-continuation mechanism is used |line-continuation|.
es_es: En la línea 18 del ejemplo anterior se usa el mecanismo |line-continuation|, continuación de línea.

source: Users with 'compatible' set will run into trouble here, they will get an error message.
es_es: Los usuarios que definan 'compatible' pueden encontrar problemas con esto, y se les mostraría un mensaje de error.

source: We can't just reset 'compatible', because that has a lot of side effects.
es_es: No podemos simplemente reiniciar 'compatible' porque tiene muchos efectos secundarios.

source: To avoid this, we will set the 'cpoptions' option to its Vim default value and restore it later.
es_es: Para evitarlo, definimos la opción 'cpoptions' con el valor predeterminado de Vim para restaurarlo más tarde.

source: That will allow the use of line-continuation and make the script work for most people.
es_es: Esto permite el uso de «line-continuation» y que el script funcione en la mayoría de sistemas.

source: It is done like this: >
es_es: Se hace de la siguiente forma: >

source: We first store the old value of 'cpoptions' in the s:save_cpo variable.
es_es: Primero almacenamos el valor antiguo de 'cpoptions' en la variable «s:save_cpo».

source: At the end of the plugin this value is restored.
es_es: El valor se restaurará al final de la extensión.

source: Notice that a script-local variable is used |s:var|.
es_es: Tenga en cuenta que se usa una variable local de script, |s:var|.

source: A global variable could already be in use for something else.
es_es: Puede que se esté utilizando una variable global para otra cosa.

source: Always use script-local variables for things that are only used in the script.
es_es: Use siempre variables locales en el script para aquello que se usa sólo en el script.

source: It's possible that a user doesn't always want to load this plugin.
es_es: Es posible que el usuario no desee cargar la extensión en cada momento.

source: Or the system administrator has dropped it in the system-wide plugin directory, but a user has his own plugin he wants to use.
es_es: O que el administrador del sistema lo haya copiado al directorio de extensiones del sistema, pero el usuario quiere usar el suyo propio.

source: Then the user must have a chance to disable loading this specific plugin.
es_es: En ese caso, el usuario debe tener la posibilidad de desactivar cargar esta extensión en particular.

source: This will make it possible: >
es_es: Lo siguiente lo hace posible: >

source: The name is recommended to start with "loaded_" and then the file name of the plugin, literally.
es_es: Se recomienda que el nombre empiece con «loaded_» y, a continuación, el nombre literal de la extensión.

source: The "g:" is prepended just to avoid mistakes when using the variable in a function (without "g:" it would be a variable local to the function).
es_es: La «g:» se añade para evitar errores al usar la variable en una función (sin la «g:», sería una variable local a la función).

source: Now let's make the plugin more interesting: We will add a mapping that adds a correction for the word under the cursor.
es_es: Ahora, vamos a hacer que la extensión sea más interesante: vamos a añadir una macro que añade una corrección para la palabra bajo el cursor.

source: We could just pick a key sequence for this mapping, but the user might already use it for something else.
es_es: Podríamos escoger una secuencia de teclas para esta macro, pero puede que el usuario la esté usando para otra cosa.

source: To allow the user to define which keys a mapping in a plugin uses, the <Leader> item can be used: >
es_es: Puede usar el elemento <Leader> para permitir que el usuario pueda definir las teclas que utiliza la macro de una extensión: >

source: The user can set the "mapleader" variable to the key sequence that he wants this mapping to start with.
es_es: El usuario puede definir la variable «mapleader» con la secuencia de teclas con la que desea iniciar esta macro.

source: Thus if the user has done: >
es_es: Por lo tanto, si el usuario define: >

source: the mapping will define "_a".
es_es: la macro se definirá como «_a».

source: If the user didn't do this, the default value will be used, which is a backslash.
es_es: En caso contrario se usará el valor predeterminado, que es una barra inversa.

source: Then a map for "\a" will be defined.
es_es: Por ello, se definiría una macro como «\a».

source: Note that <unique> is used, this will cause an error message if the mapping already happened to exist.
es_es: Tenga en cuenta se usa <unique>, lo que provocaría un mensaje de error si la macro ya existe.

source: This checks if a mapping to "<Plug>TypecorrAdd" already exists, and only defines the mapping from "<Leader>a" if it doesn't.
es_es: Esto comprueba si ya existe una macro para «<Plug>CorrecortAñadir», y sólo define la macro de «<Leader>a» si no existe.

source: The user then has a chance of putting this in his vimrc file: >
es_es: Así, el usuario tiene la posibilidad de insertar esto en su archivo «vimrc»: >

source: 30 function s:Add(from, correct) 31 let to = input("type the correction for " . a:from .
es_es: 30 function s:Anadir(desde, correccion) 31 let a = input("Introduzca la corrección para " . a:desde .

source: ": ") 32 exe ":iabbrev " . a:from .
es_es: ": ") 32 exe ":iabbrev " . a:desde .

source: " " . to ..
es_es: " " . a ..

source: Now we can call the function s:Add() from within this script.
es_es: Ahora invocamos la función «s:Anadir()» desde el mismo script.

source: If another script also defines s:Add(), it will be local to that script and can only be called from the script it was defined in.
es_es: Si otro script también define «s:Anadir()», será local a ese script y solo se invocará desde el script en el que se define.

source: There can also be a global Add() function (without the "s:"), which is again another function.
es_es: También puede existir una función global «Anadir()» (sin la «s:»), que es otra función distinta.

source: <SID> can be used with mappings.
es_es: Puede usar <SID> en una macro.

source: It generates a script ID, which identifies the current script.
es_es: Genera un identificador de script, que identifica al script actual.

source: In our typing correction plugin we use it like this: >
es_es: En nuestra extensión de corrección usaremos algo similar a esto: >

source: 24 noremap <unique> <script> <Plug>TypecorrAdd <SID>Add ..
es_es: 24 noremap <unique> <script> <Plug>CorreccortAñadir <SID>Añadir ..

source: 28 noremap <SID>Add :call <SID>Add(expand("<cword>"), 1)<CR>
es_es: 28 noremap <SID>Añadir :call <SID>Anadir(expand("<cword>"), 1)<CR>

source: Note that instead of s:Add() we use <SID>Add() here.
es_es: Tenga en cuenta que se usó «<SID>Anadir()» en lugar de «s:Anadir()» aquí.

source: That is because the mapping is typed by the user, thus outside of the script.
es_es: Eso es porque la macro es tecleada por el usuario, y por ello, se hace desde fuera del script.

source: The <SID> is translated to the script ID, so that Vim knows in which script to look for the Add() function.
es_es: <SID> se expande al identificador del script, de forma que Vim sabe en qué script buscar la función «Anadir()».

source: This is a bit complicated, but it's required for the plugin to work together with other plugins.
es_es: Es un poco complicado, pero es necesario para que la extensión funcione adecuadamente con otras.

source: The basic rule is that you use <SID>Add() in mappings and s:Add() in other places (the script itself, autocommands, user commands).
es_es: La norma básica es que debe usar <SID>Anadir() en las macros y s:Anadir() en otros sitios (el mismo script, órdenes automáticas, órdenes de usuario).

source: The "Plugin" menu is recommended for adding menu items for plugins.
es_es: Se recomienda el menú «Plugin» para añadir elementos de menú de extensiones.

source: In this case only one item is used.
es_es: En este caso, sólo se usa un elemento.

source: When adding more items, creating a submenu is recommended.
es_es: Recomendamos crear un menú secundario si añade más elementos.

source: For example, "Plugin.CVS" could be used for a plugin that offers CVS operations "Plugin.CVS.checkin", "Plugin.CVS.checkout", etc.
es_es: Por ejemplo, podría usar «Plugin.CVS» para una extensión que ofrezca operaciones CVS como «Plugin.CVS.checkin», «Plugin.CVS.checkout», etc.

source: Both <SID> and <Plug> are used to avoid that mappings of typed keys interfere with mappings that are only to be used from other mappings.
es_es: <SID> y <Plug> se usan para evitar que las macros de las teclas pulsadas interfieran con macros sólo usadas desde otras macros.

source: Note the difference between using <SID> and <Plug>:
es_es: Note la diferencia entre <SID> y <Plug>:

source: <Plug> is visible outside of the script.
es_es: <Plug> es visible fuera del script.

source: It is used for mappings which the user might want to map a key sequence to.
es_es: Se usa para macros que el usuario pueda querer ligar a un secuencia de teclas.

source: <Plug> is a special code that a typed key will never produce.
es_es: <Plug> es un código especial que una tecla nunca podrá producir.

source: To make it very unlikely that other plugins use the same sequence of characters, use this structure: <Plug> scriptname mapname In our example the scriptname is "Typecorr" and the mapname is "Add".
es_es: Para evitar que otras extensiones usen la misma secuencia de caracteres, use la estructura: <Plug> nombre-script nombre-macro En nuestro ejemplo, el nombre del script es «Correccort», y el nombre de la macro es «Añadir».

source: This results in "<Plug>TypecorrAdd".
es_es: El resultado es «<Plug>CorreccortAñadir».

source: Only the first character of scriptname and mapname is uppercase, so that we can see where mapname starts.
es_es: Solo el primer carácter de los nombres es mayúscula, facilitando ver el principio del nombre de la macro.

source: <SID> is the script ID, a unique identifier for a script.
es_es: <SID> es el identificador (ID) del script, un número único.

source: Internally Vim translates <SID> to "<SNR>123_", where "123" can be any number.
es_es: Internamente, Vim traduce <SID> como «<SNR>123_», donde «123» puede ser cualquier número.

source: Thus a function "<SID>Add()" will have a name "<SNR>11_Add()" in one script, and "<SNR>22_Add()" in another.
es_es: Por ello, la función «<SID>Anadir()» tendría el nombre «<SNR>11_Anadir()» en un script, y «<SNR>22_Anadir()» en otro.

source: You can see this if you use the ":function" command to get a list of functions.
es_es: Puede verlo si usa la orden «:function» para obtener la lista de funciones.

source: The translation of <SID> in mappings is exactly the same, that's how you can call a script-local function from a mapping.
es_es: La traducción de <SID> en las macros es idéntica, y así puede invocar una función local de un script mediante una macro.

source: The user command is defined only if no command with the same name already exists.
es_es: La orden de usuario se define únicamente si no existe una orden con el mismo nombre.

source: Otherwise we would get an error here.
es_es: En caso contrario, provocaría un error.

source: Overriding the existing user command with ":command!" is not a good idea, this would probably make the user wonder why the command he defined himself doesn't work.
es_es: Sobrescribir la orden de usuario existente con «:command!» no es una buena idea, ya que haría que el usuario se pregunte porqué no funciona la orden que ha definido.

source: The fun is that these variables can also be used in functions, autocommands and user commands that are defined in the script.
es_es: Lo interesante es que estas variables se pueden usar en funciones, órdenes automáticas y órdenes de usuario definidas en el script.

source: In our example we can add a few lines to count the number of corrections: >
es_es: En nuestro ejemplo, añadimos unas pocas líneas para contar el número de correcciones: >

source: 19 let s:count = 4 ..
es_es: 19 let s:cuenta = 4 ..

source: 30 function s:Add(from, correct) ..
es_es: 30 function s:Anadir(desde, correccion) ..

source: 34 let s:count = s:count + 1 35 echo s:count .
es_es: 34 let s:cuenta = s:cuenta + 1 35 echo s:cuenta .

source: " corrections now" 36 endfunction
es_es: " correcciones en este punto" 36 endfunction

source: First s:count is initialized to 4 in the script itself.
es_es: Al principio, «s:cuenta» se inicializa en el mismo script con un valor de 4.

source: When later the s:Add() function is called, it increments s:count.
es_es: Al invocar la función «Anadir()» posteriormente, incrementa la variable «s:cuenta».

source: It doesn't matter from where the function was called, since it has been defined in the script, it will use the local variables from this script.
es_es: No importa desde dónde se ha invocado la función, ya que está definida en el script, y usará las variables locales al script.

source: Line 33 wasn't explained yet.
es_es: Aún no hemos explicado la línea 33.
